ESBComponents/MessageValidator/src/test/resources/Scenario3_QD_Request.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
	xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion"
	xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
	xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#">
	<S:Header>
		<To xmlns="http://www.w3.org/2005/08/addressing">https://d9yf7zn1.aegis.net:9891/CONNECTGateway/NhinService/RespondingGateway_Query_Service/DocQuery
		</To>
		<Action xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:CrossGatewayQuery</Action>
		<ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</ReplyTo>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:d0988282-0afc-4b8a-bcb9-8f3e4bb3630a
		</MessageID>
		<wsse:Security S:mustUnderstand="true">
			<wsu:Timestamp
				xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
				xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/" wsu:Id="_1">
				<wsu:Created>2012-02-06T19:15:14Z</wsu:Created>
				<wsu:Expires>2012-02-06T19:20:14Z</wsu:Expires>
			</wsu:Timestamp>
			<saml2:Assertion xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
				xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
				xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xs="http://www.w3.org/2001/XMLSchema"
				ID="5d738375-9a7b-4345-a723-79369ca20172" IssueInstant="2012-02-06T19:15:14.842Z"
				Version="2.0">
				<saml2:Issuer
					Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US
				</saml2:Issuer>
				<saml2:Subject>
					<saml2:NameID
						Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">UID=Scenario 3 QDR-4.4a</saml2:NameID>
					<saml2:SubjectConfirmation
						Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
						<saml2:SubjectConfirmationData>
							<ds:KeyInfo>
								<ds:KeyValue>
									<ds:RSAKeyValue>
										<ds:Modulus>0zcLhiAEnz5u0N6/3jLa3sEi32GjpwoXZJdFu0RqXE2Ta5Mi5lhDpp8jp4h5kIfvM6TW8bUlX/f5pPhUhSvFLvxXpCZLxjPq0uVGbHsdftrrpRJ06RfXFd100o0ZXWVt7AjnZtd4Qg66u86yyQUQI8yKEgepfsGkeXdcenmw4c6F9MKBVfHq75KT301K2HA9hOA9jCREeVam/mA4TjGtkm2XSskv3gjyybwH5XYjXhWgptZSushle2sINpDEdAeKUCfEfSyhTGmWdnw0cz0ophan9TsS/rkVlswBSc7Hm5fz1TkI5oeRQwafC6fTIySgiWGuWftiU8XNuHXQYU4XjQ==
										</ds:Modulus>
										<ds:Exponent>AQAB</ds:Exponent>
									</ds:RSAKeyValue>
								</ds:KeyValue>
							</ds:KeyInfo>
						</saml2:SubjectConfirmationData>
					</saml2:SubjectConfirmation>
				</saml2:Subject>
				<saml2:AuthnStatement AuthnInstant="2012-02-06T19:15:14.358Z"
					SessionIndex="123456">
					<saml2:SubjectLocality />
					<saml2:AuthnContext>
						<saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509
						</saml2:AuthnContextClassRef>
					</saml2:AuthnContext>
				</saml2:AuthnStatement>
				<saml2:AttributeStatement>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">Lab IT
							Testcase</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">2.16.840.1.113883.0.102
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute
						Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">2.16.840.1.113883.0.102
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:nhin:names:saml:homeCommunityId">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">2.16.840.1.113883.0.102
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
						<saml2:AttributeValue>
							<hl7:Role xmlns:hl7="urn:hl7-org:v3"
								xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="46255001"
								codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED_CT"
								displayName="Pharmacist" xsi:type="hl7:CE" />
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse">
						<saml2:AttributeValue>
							<hl7:PurposeForUse xmlns:hl7="urn:hl7-org:v3"
								xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="TREATMENT"
								codeSystem="2.16.840.1.113883.3.18.7.1" codeSystemName="nhin-purpose"
								displayName="Treatment" xsi:type="hl7:CE" />
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute
						Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">RI2.102.00008^^^&amp;2.16.840.1.113883.0.102&amp;ISO
						</saml2:AttributeValue>
					</saml2:Attribute>
				</saml2:AttributeStatement>
				<saml2:AuthzDecisionStatement Decision="Permit"
					Resource="https://d9yf7zn1.aegis.net:9891/CONNECTGateway/NhinService/RespondingGateway_Query_Service/DocQuery">
					<saml2:Action Namespace="urn:oasis:names:tc:SAML:1.0:action:rwedc">Execute</saml2:Action>
					<saml2:Evidence>
						<saml2:Assertion ID="a2d1cf50-9024-4342-b1f7-6985faeaba6a"
							IssueInstant="2012-02-06T19:15:14.358Z" Version="2.0">
							<saml2:Issuer
								Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US
							</saml2:Issuer>
							<saml2:Conditions NotBefore="2012-02-06T19:15:14.358Z"
								NotOnOrAfter="2012-02-06T19:15:14.358Z" />
							<saml2:AttributeStatement>
								<saml2:Attribute Name="AccessConsentPolicy"
									NameFormat="http://www.hhs.gov/healthit/nhin" />
								<saml2:Attribute Name="InstanceAccessConsentPolicy"
									NameFormat="http://www.hhs.gov/healthit/nhin" />
							</saml2:AttributeStatement>
						</saml2:Assertion>
					</saml2:Evidence>
				</saml2:AuthzDecisionStatement>
				<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<ds:SignedInfo>
						<ds:CanonicalizationMethod
							Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
						<ds:Reference URI="#5d738375-9a7b-4345-a723-79369ca20172">
							<ds:Transforms>
								<ds:Transform
									Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
							<ds:DigestValue>Wuxz8oq5hgXuc4waqm2esTH/r90=</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue>rmodFO6PYBaaCEfRQR0V2m5A9CGo+OwXPn51OUAM3h9fu2Ms6714sc/m9yXo9XhtrphBxd2EEwJs
						XqEShbMfHQZRhlOqxAXHiQ9aeJOUD4WiknzRBm6maze99OgmNbxMIslTMqu0phnBs5sQ22yXFVg+
						ElXYBlv5bOoTKeWYzREmeidt0qmMoXUrP5iGOWR170CJhWTfipZ+GJ+V8UCbX+0OKcxiwdO6PPX7
						/yrhDXdW1+fruGsEv+CR7ykbWb/u7cNNz8l0rybY7t7BZseN0P99ugsyqonXu7550YwOyuFVFjR9
						dz7eFtyixdUpygpjgt8/ePZCkfvfr6uhawgzuw==</ds:SignatureValue>
					<ds:KeyInfo>
						<ds:KeyValue>
							<ds:RSAKeyValue>
								<ds:Modulus>0zcLhiAEnz5u0N6/3jLa3sEi32GjpwoXZJdFu0RqXE2Ta5Mi5lhDpp8jp4h5kIfvM6TW8bUlX/f5
									pPhUhSvFLvxXpCZLxjPq0uVGbHsdftrrpRJ06RfXFd100o0ZXWVt7AjnZtd4Qg66u86yyQUQI8yK
									EgepfsGkeXdcenmw4c6F9MKBVfHq75KT301K2HA9hOA9jCREeVam/mA4TjGtkm2XSskv3gjyybwH
									5XYjXhWgptZSushle2sINpDEdAeKUCfEfSyhTGmWdnw0cz0ophan9TsS/rkVlswBSc7Hm5fz1TkI
									5oeRQwafC6fTIySgiWGuWftiU8XNuHXQYU4XjQ==</ds:Modulus>
								<ds:Exponent>AQAB</ds:Exponent>
							</ds:RSAKeyValue>
						</ds:KeyValue>
					</ds:KeyInfo>
				</ds:Signature>
			</saml2:Assertion>
			<ds:Signature
				xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
				xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/" Id="_2">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod
						Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<exc14n:InclusiveNamespaces PrefixList="wsse S" />
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
					<ds:Reference URI="#_1">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<exc14n:InclusiveNamespaces
									PrefixList="wsu wsse S" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>WZI3ijZsrUpPtzK8Io8iW+IF9EQ=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>cWmMhtUDMVGkkVr9XWyGSbz7EHjz0iENSqd+E7mye6OnBeTOz7T4fhYYkcD21ipQkrEVX+L3Cjjcu0EtXXOSIOTwi4CLTvZ3a/oTl5eLEMDQkeAKzHupcaYXPLoWzoAa1f6SpXS+6J3K0InveXHKsVPgDJo8itqiKRanuDlKbbZEoYNnyVsAz1QJpT1O5kmk/rMcx1/g3Z0K+O5dM49RUilQI8W0FwUCgUM1QyVSvrC2vOTG6La+c/941aJy+ZHTknGePIKCIMaAZrU5mdowQ1WszqsfHh1MOYsG1w84pwsULLjccoDHQpYispOUwZlxY629mtuqxW7Es0790lLiig==
				</ds:SignatureValue>
				<ds:KeyInfo>
					<wsse:SecurityTokenReference
						wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0">
						<wsse:KeyIdentifier
							ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">5d738375-9a7b-4345-a723-79369ca20172
						</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
	</S:Header>
	<S:Body>
		<ns4:AdhocQueryRequest xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"
			xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0"
			xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns6="urn:gov:hhs:fha:nhinc:gateway:samltokendata"
			maxResults="-1" startIndex="0" federated="false">
			<ns4:ResponseOption returnComposedObjects="false"
				returnType="LeafClass" />
			<ns2:AdhocQuery home="2.16.840.1.113883.0.210"
				id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
				<ns2:Slot name="$XDSDocumentEntryPatientId">
					<ns2:ValueList>
						<ns2:Value>'VEN21000008^^^&amp;2.16.840.1.113883.0.210&amp;ISO'
						</ns2:Value>
					</ns2:ValueList>
				</ns2:Slot>
				<ns2:Slot name="$XDSDocumentEntryStatus">
					<ns2:ValueList>
						<ns2:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved','urn:oasis:names:tc:ebxml-regrep:StatusType:DeferredCreation')
						</ns2:Value>
					</ns2:ValueList>
				</ns2:Slot>
			</ns2:AdhocQuery>
		</ns4:AdhocQueryRequest>
	</S:Body>
</S:Envelope>
