ihe-utility/src/test/resources/1367834825110_iti_18_body.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
	<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"
		xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
		<wsa:To>http://203.64.84.112:8020/axis2/services/xdsregistryb?wsdl</wsa:To>
		<wsa:MessageID>urn:uuid:e475e8e5-6752-4270-a795-781e599fc2ee</wsa:MessageID>
		<wsa:Action>urn:ihe:iti:2007:RegistryStoredQuery</wsa:Action>
	</soapenv:Header>
	<soapenv:Body xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
		<query:AdhocQueryRequest
			xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0">
			<rs:RequestSlotList xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" />
			<query:ResponseOption returnType="ObjectRef" />
			<rim:AdhocQuery xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"
				id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
				<rim:Slot name="$XDSDocumentEntryPatientId">
					<rim:ValueList>
						<rim:Value>'204388899^^^&amp;1.3.6.1.4.1.21367.2009.1.2.300&amp;ISO'</rim:Value>
					</rim:ValueList>
				</rim:Slot>
				<rim:Slot name="$XDSDocumentEntryStatus">
					<rim:ValueList>
						<rim:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</rim:Value>
					</rim:ValueList>
				</rim:Slot>
				<rim:Slot name="$XDSDocumentEntryCreationTimeTo">
					<rim:ValueList>
						<rim:Value>20130501</rim:Value>
					</rim:ValueList>
				</rim:Slot>
				<rim:Slot name="$XDSDocumentEntryCreationTimeFrom">
					<rim:ValueList>
						<rim:Value>20130430</rim:Value>
					</rim:ValueList>
				</rim:Slot>
			</rim:AdhocQuery>
		</query:AdhocQueryRequest>
	</soapenv:Body>
</soapenv:Envelope>